// Copyright Schneider-Electric 2024

{
  "Logging": {
    "LogLevel": {
      "Default": "Information",
      "Microsoft.AspNetCore": "Warning"
    }
  },
  "AllowedHosts": "*",
  "SwaggerSettings": {
    "RoutePrefixWithSlash": "https://localhost:5001/",
    "Title": "ETPX Firmware Repository Service API",
    "Version": "v1",
    "Description": "<p>The Firmware Repository Service enables panel builders and electricians to find and download device firmware files in order to carry out device firmware upgrade.<br/>Firmware is software that is embedded in a device's hardware and controls its operation. Firmware updates are often necessary to fix bugs, add new features, or improve performance.</p><p>A firmware repository service can be used to:<br/> - Get the firmware binary from the cloud based on the commercial reference and version of the firmware binary<br/> - Distribute firmware images to devices in a secure and efficient manner.\n</p> <p><b>Authentication Information</b></p>\n<br>    <p>Access to all Commissioning services will be through authentication services provided by Schneider’s Identity Management System (IDMS) and the Azure APIM Gateway access. \n    Access to the vast majority of the CommissioningAPI endpoints require both an IDMS and application key(etpx-apim-subscription-key), from the consuming application, to access the Commissioning Services. However, there are a few pre-approved exceptions for specific clients and Commisioning endpoints, where only the ApplicationKey(etpx-apim-subscription-key) is required.\n  Application Keys are generated from Azure APIM and  assigned to consumer applications. \n      The App Key is mandatory for all clients requesting connections to the Commissioning APIs.\n      IDMS Tokens are generated and acquired based on the client’s integration with Schneider IDMS,when the user logs into the Schneider domain from the client application. This User token is passed during the request to the specific Commissioning Endpoint.\n     All API requests must be made over HTTPS. Calls made over plain HTTP will fail. API requests without authentication will also fail.</p>\n<br>  <b> Authentication</b> <br/> <b><br/>API Key: App Token </b><br/><br/> <b>Security Scheme Type:</b>apiKey <br/> <b> Header parameter name: </b> etpx-apim-subscription-key <br/><br/><br><b>API Key:IDMS Token </b><br/><br/> <b>Security Scheme Type:</b> apiKey <br/> <b> Headerparameter name: </b> Authorization <br/><br/>"
  }
}
